Tekla Open API Reference for Tekla Structures 2025
Connection.SetPrimaryObject Method
 Sets the primary object of the connection.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool SetPrimaryObject(
	ModelObject M
)
Public Function SetPrimaryObject (
	M As ModelObject
) As Boolean
Parameters
M
Type: Tekla.Structures.Model.ModelObject
The primary object.
Return Value
Type: Boolean
True on success.
See Also
Reference
Connection Class
Tekla.Structures.Model Namespace